# 文本识别表情内容
def emotion_recognition(response):
    """
    基于关键词，简单的情绪识别
    :param response: 需要情绪识别的文本
    :return: 表情内容
    """

    # =========== 开心 ==============
    happy = [
        "笑",
        "不错",
        "哈",
        "开心",
        "呵",
        "嘻",
        "你好",
        "在吗",
        "干嘛",
        "名字",
        "欢迎",
        "早安",
        "晚安",
    ]

    # =========== 生气 ==============
    angry = ["生气", "不理你", "骂", "臭", "打死", "可恶", "白痴", "忘记"]

    # =========== 尴尬 ==============
    awkward = ["尴尬", "无聊", "无奈", "傻子", "郁闷"]

    # =========== 厌恶 ==============
    disgust = ["恶心"]

    # =========== 疑问 ==============
    question = ["疑问", "？"]

    emotions = ["happy", "angry", "awkward", "question", "disgust"]

    for i in emotions:
        for j in eval(i):
            if j in response:
                return i

    return "neutral"


# # =========== 难过 ==============
# sadness = ["难过", "伤心", "委屈", "泪", "哭", "泪流", "哭泣", "流泪"]

# # =========== 惊讶 ==============
# text = ["惊讶", "吓", "吓人", "吓死", "吓坏", "吓死人", "吓死鬼"]

# # =========== 恐惧 ==============
# text = ["恐惧", "害怕", "恐怖", "吓", "吓人", "吓死", "吓死人", "吓死鬼"]


if __name__ == "__main__":
    response = "早安阁下"
    emotion = emotion_recognition(response)
    print(emotion)
